Revit 2027 API
ColumnAttachment.GetColumnAttachment(FamilyInstance, Int32) Method
 Look up a column attachment. There is at most one attachment on the base and one on the top.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ColumnAttachment GetColumnAttachment(
	FamilyInstance column,
	int baseOrTop
)
Public Shared Function GetColumnAttachment (
	column As FamilyInstance,
	baseOrTop As Integer
) As ColumnAttachment
public:
static ColumnAttachment^ GetColumnAttachment(
	FamilyInstance^ column,
	int baseOrTop
)
static member GetColumnAttachment :
        column : FamilyInstance *
        baseOrTop : int -> ColumnAttachment
Parameters
column FamilyInstance
 A column.
baseOrTop Int32
 0 for base, 1 for top.
Return Value
ColumnAttachment
 The column attachment for the base or top of the column, or null if that end of the column is unattached.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  baseOrTop must be either 0 or 1.
See Also
Reference
ColumnAttachment Class
GetColumnAttachment Overload
Autodesk.Revit.DB Namespace